nxp-mcuxpresso/mcux-sdk-examples/mimxrt685audevk/dsp_examples/rtp_demo/cm33/pin_mux.c
    gpio_pin_config_t SD_RST_N_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_10 (pin T15)  */
    GPIO_PinInit(BOARD_INITPINSM2_SD_RST_N_GPIO, BOARD_INITPINSM2_SD_RST_N_PORT, BOARD_INITPINSM2_SD_RST_N_PIN, &SD_RST_N_config);

    const uint32_t WL_REG_ON = (/* Pin is configured as PIO0_12 */
                                IOPCTL_PIO_FUNC0 |
                                /* Disable pull-up / pull-down function */
                                IOPCTL_PIO_PUPD_DI |
                                /* Enable pull-down function */
                                IOPCTL_PIO_PULLDOWN_EN |
                                /* Disable input buffer function */
                                IOPCTL_PIO_INBUF_DI |
                                /* Normal mode */
                                IOPCTL_PIO_SLEW_RATE_NORMAL |
                                /* Normal drive */
                                IOPCTL_PIO_FULLDRIVE_DI |
                                /* Analog mux is disabled */
                                IOPCTL_PIO_ANAMUX_DI |
                                /* Pseudo Output Drain is disabled */
                                IOPCTL_PIO_PSEDRAIN_DI |
                                /* Input function is not inverted */
                                IOPCTL_PIO_INV_DI);
    /* PORT0 PIN12 (coords: E3) is configured as PIO0_12 */
    IOPCTL_PinMuxSet(IOPCTL, BOARD_INITPINSM2_WL_REG_ON_PORT, BOARD_INITPINSM2_WL_REG_ON_PIN, WL_REG_ON);

    const uint32_t SD_RST_N = (/* Pin is configured as PIO2_10 */
                               IOPCTL_PIO_FUNC0 |
                               /* Disable pull-up / pull-down function */
                               IOPCTL_PIO_PUPD_DI |
                               /* Enable pull-down function */
                               IOPCTL_PIO_PULLDOWN_EN |
                               /* Disable input buffer function */
                               IOPCTL_PIO_INBUF_DI |
                               /* Normal mode */
                               IOPCTL_PIO_SLEW_RATE_NORMAL |
                               /* Normal drive */
                               IOPCTL_PIO_FULLDRIVE_DI |
                               /* Analog mux is disabled */
                               IOPCTL_PIO_ANAMUX_DI |
                               /* Pseudo Output Drain is disabled */
                               IOPCTL_PIO_PSEDRAIN_DI |
                               /* Input function is not inverted */
                               IOPCTL_PIO_INV_DI);
    /* PORT2 PIN10 (coords: T15) is configured as PIO2_10 */
    IOPCTL_PinMuxSet(IOPCTL, BOARD_INITPINSM2_SD_RST_N_PORT, BOARD_INITPINSM2_SD_RST_N_PIN, SD_RST_N);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
